
&НаКлиенте
Процедура Рассчитать(Команда)
	
	ДеньКредита = ДатаПолученияЗайма;
	СуммаКредита = СуммаЗайма;
	
	Пока НачалоДня(ДеньКредита) <= НачалоДня(ДатаВозвратаЗайма) Цикл
		
		
		Если ДеньНедели(ДеньКредита) < 6 Тогда
		
			КоличествоДнейВГоду = ДеньГода(КонецГода(ДеньКредита));
			ПроцентовВЭтотДень = СуммаКредита * ПроцентнаяСтавка / 100 / КоличествоДнейВГоду;
			
			СуммаКредита = СуммаКредита + ПроцентовВЭтотДень;
		
		КонецЕсли;
		
		Если ДосрочноеПогашение Тогда
		
			Если НачалоДня(ДеньКредита) = НачалоДня(ДатаДосрочногоПогашения) Тогда
			
				СуммаКредита = СуммаКредита - СуммаДосрочногоПогашения;
			
			КонецЕсли;	
		
		КонецЕсли;
		
		ДеньКредита = ДобавитьДень(ДеньКредита);
	
	КонецЦикла;
	
	Если ДосрочноеПогашение Тогда
		
		СуммаКВозврату = СуммаКредита + СуммаДосрочногоПогашения;	
		
	Иначе	
		
		СуммаКВозврату = СуммаКредита;
		
	КонецЕсли;
	
	
	Переплата = СуммаКВозврату - СуммаЗайма;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьДень(Дата)

	Возврат Дата + 60 * 60 * 24;	

КонецФункции // ДобавитьДень()

&НаКлиенте
Процедура ДосрочноеПогашениеПриИзменении(Элемент)
	Элементы.ГруппаДосрочноеПогашение.Видимость = ДосрочноеПогашение;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаДосрочноеПогашение.Видимость = ДосрочноеПогашение;
КонецПроцедуры


&НаКлиенте
Процедура ДатаДосрочногоПогашенияПриИзменении(Элемент)
	
	ОбнулитьДату = Ложь;
	
	Если НачалоДня(ДатаДосрочногоПогашения) >  НачалоДня(ДатаВозвратаЗайма) Тогда
	
		Сообщить("Дата досрочного погашения не должна быть больше даты возврата займа");	
		
		ОбнулитьДату = Истина;
		
	КонецЕсли; 
	
	Если НачалоДня(ДатаДосрочногоПогашения) <=  НачалоДня(ДатаПолученияЗайма) Тогда
	
		Сообщить("Дата досрочного погашения не должна быть меньше либо равной дате получения займа");	
		
		ОбнулитьДату = Истина;
		
	КонецЕсли;
	
	Если ОбнулитьДату Тогда
	
		ДатаДосрочногоПогашения = Дата("00010101");	
	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СуммаДосрочногоПогашенияПриИзменении(Элемент)
	
	Если СуммаДосрочногоПогашения > СуммаЗайма / 2 Тогда
	
		Сообщить("Сумма досрочного погадения не должна быть больше половины от суммы займа");
		
		СуммаДосрочногоПогашения = СуммаЗайма / 2;
	
	КонецЕсли;
	//СуммаДосрочногоПогашенияПриИзменении
КонецПроцедуры

